# Test data API and download data #1
240416

In [16]:
from datetime import datetime
# from pykrx import stock
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import yfinance as yf

In [17]:
df_rate = yf.download('USDKRW=X')
df_rate.head()

[*********************100%%**********************]  1 of 1 completed

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2003-12-01,1197.300049,1203.500000,1195.000000,1198.400024,1198.400024,0
2003-12-02,1198.099976,1198.500000,1186.199951,1195.000000,1195.000000,0
2003-12-03,1195.000000,1198.400024,1192.500000,1192.500000,1192.500000,0
2003-12-04,1192.599976,1197.900024,1174.800049,1190.099976,1190.099976,0
2003-12-05,1189.400024,1193.800049,1178.599976,1184.699951,1184.699951,0

In [18]:
df_rate.tail()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2024-05-22,1363.420044,1367.839966,1359.949951,1363.420044,1363.420044,0
2024-05-23,1365.810059,1367.130005,1358.119995,1365.810059,1365.810059,0
2024-05-24,1367.619995,1371.430054,1363.630005,1367.619995,1367.619995,0
2024-05-27,1365.709961,1366.920044,1360.050049,1365.709961,1365.709961,0
2024-05-28,1360.930054,1362.810059,1354.849976,1360.930054,1360.930054,0

In [19]:
df_rate.to_csv('./usdkrw.csv')

In [20]:
df_gold = yf.download('GC=F')
df_gold.head()

[*********************100%%**********************]  1 of 1 completed

                  Open        High         Low       Close   Adj Close  Volume
Date
2000-08-30  273.899994  273.899994  273.899994  273.899994  273.899994       0
2000-08-31  274.799988  278.299988  274.799988  278.299988  278.299988       0
2000-09-01  277.000000  277.000000  277.000000  277.000000  277.000000       0
2000-09-05  275.799988  275.799988  275.799988  275.799988  275.799988       2
2000-09-06  274.200012  274.200012  274.200012  274.200012  274.200012       0

In [21]:
df_gold.to_csv('./gold.csv')

In [22]:
df_snp = yf.download('^GSPC')
df_snp.head()

[*********************100%%**********************]  1 of 1 completed

                 Open       High        Low      Close  Adj Close  Volume
Date
1927-12-30  17.660000  17.660000  17.660000  17.660000  17.660000       0
1928-01-03  17.760000  17.760000  17.760000  17.760000  17.760000       0
1928-01-04  17.719999  17.719999  17.719999  17.719999  17.719999       0
1928-01-05  17.549999  17.549999  17.549999  17.549999  17.549999       0
1928-01-06  17.660000  17.660000  17.660000  17.660000  17.660000       0

In [23]:
df_snp.tail()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2024-05-21,5298.689941,5324.319824,5297.870117,5321.410156,5321.410156,3662240000
2024-05-22,5319.279785,5323.180176,5286.009766,5307.009766,5307.009766,3847130000
2024-05-23,5340.259766,5341.879883,5256.930176,5267.839844,5267.839844,3869520000
2024-05-24,5281.450195,5311.649902,5278.390137,5304.720215,5304.720215,3005510000
2024-05-28,5315.910156,5315.910156,5280.890137,5306.040039,5306.040039,3751540000

In [24]:
df_snp.to_csv('./snp.csv')

In [25]:
df_ko = yf.download('^KS11')
df_ko.to_csv('./kospi.csv')
df_ko.head()

[*********************100%%**********************]  1 of 1 completed

                  Open        High         Low       Close   Adj Close  Volume
Date
1996-12-11  705.989990  709.479980  704.429993  704.679993  704.679993   28000
1996-12-12  705.109985  706.010010  688.739990  689.380005  689.380005   25900
1996-12-13  690.440002  695.719971  677.640015  689.070007  689.070007   26500
1996-12-16  686.969971  686.969971  667.710022  673.919983  673.919983   22800
1996-12-17  675.349976  680.090027  660.390015  663.349976  663.349976   31600

In [26]:
df_index = pd.concat([df_snp['Close'], df_ko['Close']], axis=1).loc['1996-12-11': , :]
df_index.columns = ['S&P', 'KOSPI']
df_index.head()

                   S&P       KOSPI
Date
1996-12-11  740.729980  704.679993
1996-12-12  729.299988  689.380005
1996-12-13  728.640015  689.070007
1996-12-16  720.979980  673.919983
1996-12-17  726.039978  663.349976

In [27]:
df_snp.loc['1996-12-11':'1996-12-31', :]

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
1996-12-11,747.539978,747.539978,732.750000,740.729980,740.729980,494210000
1996-12-12,740.729980,744.859985,729.299988,729.299988,729.299988,492920000
1996-12-13,729.330017,731.400024,721.969971,728.640015,728.640015,458540000
1996-12-16,728.640015,732.679993,719.400024,720.979980,720.979980,447560000
1996-12-17,720.979980,727.669983,716.690002,726.039978,726.039978,519840000
1996-12-18,726.039978,732.760010,726.039978,731.539978,731.539978,500490000
1996-12-19,731.539978,746.059998,731.539978,745.760010,745.760010,526410000
1996-12-20,745.760010,755.409973,745.760010,748.869995,748.869995,654340000
1996-12-23,748.869995,750.400024,743.280029,746.919983,746.919983,343280000
1996-12-24,746.919983,751.030029,746.919983,751.030029,751.030029,165140000
1996-12-26,751.030029,757.070007,751.020020,755.820007,755.820007,254630000
1996-12-27,755.820007,758.750000,754.820007,756.789978,756.789978,253810000
1996-12-30,756.789978,759.200012,752.729980,753.849976,753.849976,339060000
1996-12-31,753.849976,753.950012,740.739990,740.739990,740.739990,399760000

In [28]:
df_sec = yf.download('005930.KS')
df_sec.to_csv('./sec.csv')
df_sec.tail()

[*********************100%%**********************]  1 of 1 completed

               Open     High      Low    Close  Adj Close    Volume
Date
2024-05-23  77700.0  79100.0  77100.0  78300.0    78300.0  18728087
2024-05-24  76800.0  77000.0  75700.0  75900.0    75900.0  27891278
2024-05-27  75300.0  78200.0  74000.0  77200.0    77200.0  43825202
2024-05-28  76500.0  78000.0  76200.0  77600.0    77600.0  18539072
2024-05-29  77700.0  78200.0  75200.0  75500.0    75500.0  26855124

In [29]:
df_kospi = pd.read_csv('./kospi.csv')
df_sec = pd.read_csv('./sec.csv')
df_gold = pd.read_csv('./gold.csv')
df_snp = pd.read_csv('./snp.csv')
df_crate = pd.read_csv('./usdkrw.csv')

In [30]:
start_date = [df_crate.iloc[0, 0], df_gold.iloc[0, 0], df_kospi.iloc[0, 0], df_sec.iloc[0, 0], df_snp.iloc[0, 0]]
start_date

['2003-12-01', '2000-08-30', '1996-12-11', '2000-01-04', '1927-12-30']

In [31]:
df_list = [df_crate, df_gold, df_kospi, df_sec, df_snp]
df_names = ['currency', 'gold', 'kospi', 'sec', 'S&P']
for i, li in enumerate(df_list):
    li.rename(columns = {'Adj Close' : df_names[i]}, inplace = True)
    li['Date'] = pd.to_datetime(li['Date'])
    li.sort_values('Date', ascending=True, inplace=True)
    li.set_index('Date', inplace=True)
df = pd.concat([df_snp.loc['2003-12-01': , ['S&P']], df_crate.loc['2003-12-01':, ['currency']]], axis=1)
df = pd.concat([df.loc[: , :], df_gold.loc['2003-12-01':, ['gold']]], axis=1)
df = pd.concat([df.loc[: , :], df_kospi.loc['2003-12-01':, ['kospi']]], axis=1)
# df['kospi+1'] = df_kospi.loc['2003-12-02':, ['kospi']].values.reshape(-1)

# df.columns = ['S&P', 'currency', 'gold', 'kospi', 'kospi_nextday']
# df = pd.concat([df_snp, df_crate])
df.head()

                    S&P     currency        gold       kospi
Date
2003-12-01  1070.119995  1198.400024  402.700012  807.390015
2003-12-02  1066.619995  1195.000000  403.700012  807.780029
2003-12-03  1064.729980  1192.500000  403.899994  808.340027
2003-12-04  1069.719971  1190.099976  403.299988  805.130005
2003-12-05  1061.500000  1184.699951  406.399994  789.409973

In [32]:
len(df_kospi.loc['2003-12-02':, ['kospi']].values.reshape(-1))

5059

In [33]:
df['kospi_shift'] = df_kospi['kospi'].shift(-1)
df.head()

                    S&P     currency        gold       kospi  kospi_shift
Date
2003-12-01  1070.119995  1198.400024  402.700012  807.390015   807.780029
2003-12-02  1066.619995  1195.000000  403.700012  807.780029   808.340027
2003-12-03  1064.729980  1192.500000  403.899994  808.340027   805.130005
2003-12-04  1069.719971  1190.099976  403.299988  805.130005   789.409973
2003-12-05  1061.500000  1184.699951  406.399994  789.409973   784.799988

In [34]:
df.isna().sum()

S&P            191
currency        32
gold           200
kospi          288
kospi_shift    289
dtype: int64

In [35]:
# in case of last value, check bfill after ffill
df.ffill(inplace=True)
df.bfill(inplace=True)

In [36]:
df.isna().sum()

S&P            0
currency       0
gold           0
kospi          0
kospi_shift    0
dtype: int64

In [37]:
df.to_csv('./total.csv')